-- 基础信息
local base_info = {
	group_id = 111102063
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	[63002] = { config_id = 63002, gadget_id = 70310001, pos = { x = 1728.470, y = 213.881, z = -1370.785 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, vision_level = VisionLevelType.VISION_LEVEL_REMOTE }
}

-- 区域
regions = {
	[63001] = { config_id = 63001, shape = RegionShape.SPHERE, radius = 5, pos = { x = 1728.873, y = 213.720, z = -1371.032 }, vision_type_list = { 11020001 } }
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 63002 },
		regions = { 63001 },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================

require "V3_0/Test_ServerVisionType"