-- 基础信息
local base_info = {
	group_id = 133302667
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 667001, gadget_id = 70290001, pos = { x = -308.986, y = 147.218, z = 2422.163 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 24 },
	{ config_id = 667002, gadget_id = 70500000, pos = { x = -308.969, y = 147.787, z = 2422.564 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 3002, owner = 667001, area_id = 24 },
	{ config_id = 667003, gadget_id = 70500000, pos = { x = -309.051, y = 148.073, z = 2421.767 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 3002, owner = 667001, area_id = 24 },
	{ config_id = 667004, gadget_id = 70500000, pos = { x = -308.718, y = 148.485, z = 2422.060 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 3002, owner = 667001, area_id = 24 },
	{ config_id = 667005, gadget_id = 70540037, pos = { x = -252.483, y = 174.191, z = 2429.821 }, rot = { x = 0.000, y = 252.239, z = 0.000 }, level = 27, area_id = 24 },
	{ config_id = 667006, gadget_id = 70500000, pos = { x = -252.097, y = 174.567, z = 2429.642 }, rot = { x = 0.000, y = 252.240, z = 0.000 }, level = 27, point_type = 2049, owner = 667005, area_id = 24 },
	{ config_id = 667007, gadget_id = 70500000, pos = { x = -252.652, y = 174.912, z = 2430.134 }, rot = { x = 0.000, y = 162.262, z = 0.000 }, level = 27, point_type = 2049, owner = 667005, area_id = 24 },
	{ config_id = 667008, gadget_id = 70540037, pos = { x = -310.052, y = 184.043, z = 2361.799 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 24 },
	{ config_id = 667009, gadget_id = 70500000, pos = { x = -309.666, y = 184.419, z = 2361.620 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2049, owner = 667008, area_id = 24 },
	{ config_id = 667010, gadget_id = 70500000, pos = { x = -310.221, y = 184.764, z = 2362.113 }, rot = { x = 0.000, y = 270.022, z = 0.000 }, level = 27, point_type = 2049, owner = 667008, area_id = 24 },
	{ config_id = 667011, gadget_id = 70290002, pos = { x = -257.817, y = 169.653, z = 2444.744 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 24 },
	{ config_id = 667012, gadget_id = 70500000, pos = { x = -258.888, y = 171.271, z = 2445.458 }, rot = { x = 0.000, y = 265.000, z = 0.000 }, level = 27, point_type = 3001, owner = 667011, area_id = 24 },
	{ config_id = 667013, gadget_id = 70500000, pos = { x = -256.947, y = 172.281, z = 2443.733 }, rot = { x = 0.000, y = 314.000, z = 0.000 }, level = 27, point_type = 3001, owner = 667011, area_id = 24 },
	{ config_id = 667014, gadget_id = 70500000, pos = { x = -257.774, y = 172.561, z = 2446.125 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 3001, owner = 667011, area_id = 24 },
	{ config_id = 667015, gadget_id = 70540037, pos = { x = -365.718, y = 173.649, z = 2462.713 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 24 },
	{ config_id = 667016, gadget_id = 70500000, pos = { x = -365.331, y = 174.024, z = 2462.534 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2049, owner = 667015, area_id = 24 },
	{ config_id = 667017, gadget_id = 70500000, pos = { x = -365.887, y = 174.370, z = 2463.027 }, rot = { x = 0.000, y = 270.022, z = 0.000 }, level = 27, point_type = 2049, owner = 667015, area_id = 24 },
	{ config_id = 667018, gadget_id = 70290003, pos = { x = -401.666, y = 194.234, z = 2436.116 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 24 },
	{ config_id = 667019, gadget_id = 70500000, pos = { x = -401.666, y = 194.337, z = 2436.025 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 3003, owner = 667018, area_id = 24 },
	{ config_id = 667020, gadget_id = 70500000, pos = { x = -401.666, y = 194.337, z = 2436.217 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 3003, owner = 667018, area_id = 24 },
	{ config_id = 667021, gadget_id = 70540041, pos = { x = -504.172, y = 161.326, z = 2555.531 }, rot = { x = 335.988, y = 0.229, z = 359.515 }, level = 27, area_id = 24 },
	{ config_id = 667022, gadget_id = 70500000, pos = { x = -503.904, y = 162.308, z = 2555.760 }, rot = { x = 322.935, y = 6.310, z = 10.977 }, level = 27, point_type = 2051, owner = 667021, area_id = 24 },
	{ config_id = 667023, gadget_id = 70500000, pos = { x = -504.092, y = 162.197, z = 2555.551 }, rot = { x = 320.288, y = 9.428, z = 344.736 }, level = 27, point_type = 2051, owner = 667021, area_id = 24 },
	{ config_id = 667024, gadget_id = 70500000, pos = { x = -503.873, y = 161.949, z = 2555.381 }, rot = { x = 347.017, y = 8.356, z = 10.875 }, level = 27, point_type = 2051, owner = 667021, area_id = 24 },
	{ config_id = 667025, gadget_id = 70500000, pos = { x = -504.453, y = 161.852, z = 2555.466 }, rot = { x = 335.490, y = 0.566, z = 341.378 }, level = 27, point_type = 2051, owner = 667021, area_id = 24 },
	{ config_id = 667026, gadget_id = 70290001, pos = { x = -243.633, y = 194.105, z = 2485.271 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 24 },
	{ config_id = 667027, gadget_id = 70500000, pos = { x = -243.616, y = 194.674, z = 2485.672 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 3002, owner = 667026, area_id = 24 },
	{ config_id = 667028, gadget_id = 70500000, pos = { x = -243.698, y = 194.960, z = 2484.875 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 3002, owner = 667026, area_id = 24 },
	{ config_id = 667029, gadget_id = 70500000, pos = { x = -243.365, y = 195.372, z = 2485.168 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 3002, owner = 667026, area_id = 24 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 667001, 667002, 667003, 667004, 667005, 667006, 667007, 667008, 667009, 667010, 667011, 667012, 667013, 667014, 667015, 667016, 667017, 667018, 667019, 667020, 667021, 667022, 667023, 667024, 667025, 667026, 667027, 667028, 667029 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================