-- 基础信息
local base_info = {
	group_id = 133301353
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 353001, gadget_id = 70540044, pos = { x = -196.165, y = 225.990, z = 3515.418 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 29 },
	{ config_id = 353002, gadget_id = 70500000, pos = { x = -196.165, y = 225.990, z = 3515.418 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2048, owner = 353001, area_id = 29 },
	{ config_id = 353003, gadget_id = 70540044, pos = { x = -216.072, y = 225.990, z = 3509.938 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 29 },
	{ config_id = 353004, gadget_id = 70500000, pos = { x = -216.072, y = 225.990, z = 3509.938 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2048, owner = 353003, area_id = 29 },
	{ config_id = 353005, gadget_id = 70540044, pos = { x = -200.095, y = 225.990, z = 3534.768 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 29 },
	{ config_id = 353006, gadget_id = 70500000, pos = { x = -200.095, y = 225.990, z = 3534.768 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2048, owner = 353005, area_id = 29 },
	{ config_id = 353007, gadget_id = 70540044, pos = { x = -206.943, y = 225.990, z = 3534.524 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 29 },
	{ config_id = 353008, gadget_id = 70500000, pos = { x = -206.943, y = 225.990, z = 3534.524 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2048, owner = 353007, area_id = 29 },
	{ config_id = 353009, gadget_id = 70500000, pos = { x = -238.356, y = 238.567, z = 3481.993 }, rot = { x = 0.000, y = 132.483, z = 0.000 }, level = 27, point_type = 2052, area_id = 29 },
	{ config_id = 353010, gadget_id = 70500000, pos = { x = -209.838, y = 225.675, z = 3504.939 }, rot = { x = 0.000, y = 200.607, z = 0.000 }, level = 27, point_type = 2001, area_id = 29 },
	{ config_id = 353011, gadget_id = 70500000, pos = { x = -184.661, y = 241.091, z = 3567.092 }, rot = { x = 0.000, y = 120.367, z = 0.000 }, level = 27, point_type = 2004, area_id = 29 },
	{ config_id = 353012, gadget_id = 70500000, pos = { x = -174.153, y = 236.658, z = 3534.350 }, rot = { x = 0.000, y = 239.427, z = 0.000 }, level = 27, point_type = 2052, area_id = 29 },
	{ config_id = 353013, gadget_id = 70500000, pos = { x = -147.600, y = 270.038, z = 3417.527 }, rot = { x = 0.000, y = 76.683, z = 0.000 }, level = 27, point_type = 2004, area_id = 29 },
	{ config_id = 353014, gadget_id = 70540041, pos = { x = -249.063, y = 246.603, z = 3546.628 }, rot = { x = 5.731, y = 276.111, z = 356.675 }, level = 27, area_id = 29 },
	{ config_id = 353015, gadget_id = 70500000, pos = { x = -249.257, y = 246.986, z = 3546.470 }, rot = { x = 337.475, y = 285.470, z = 338.303 }, level = 27, point_type = 2051, owner = 353014, area_id = 29 },
	{ config_id = 353016, gadget_id = 70500000, pos = { x = -248.872, y = 247.153, z = 3546.995 }, rot = { x = 4.799, y = 223.408, z = 33.723 }, level = 27, point_type = 2051, owner = 353014, area_id = 29 },
	{ config_id = 353017, gadget_id = 70500000, pos = { x = -248.774, y = 247.053, z = 3546.722 }, rot = { x = 17.748, y = 247.675, z = 354.169 }, level = 27, point_type = 2051, owner = 353014, area_id = 29 },
	{ config_id = 353018, gadget_id = 70500000, pos = { x = -248.614, y = 246.821, z = 3546.860 }, rot = { x = 35.560, y = 215.171, z = 351.864 }, level = 27, point_type = 2051, owner = 353014, area_id = 29 },
	{ config_id = 353019, gadget_id = 70540041, pos = { x = -265.242, y = 242.700, z = 3375.999 }, rot = { x = 0.000, y = 296.040, z = 0.000 }, level = 27, area_id = 29 },
	{ config_id = 353020, gadget_id = 70500000, pos = { x = -265.497, y = 243.003, z = 3376.228 }, rot = { x = 331.307, y = 304.072, z = 340.983 }, level = 27, point_type = 2051, owner = 353019, area_id = 29 },
	{ config_id = 353021, gadget_id = 70500000, pos = { x = -264.903, y = 243.290, z = 3376.105 }, rot = { x = 3.949, y = 243.674, z = 40.312 }, level = 27, point_type = 2051, owner = 353019, area_id = 29 },
	{ config_id = 353022, gadget_id = 70500000, pos = { x = -265.117, y = 243.218, z = 3375.898 }, rot = { x = 14.217, y = 269.045, z = 0.000 }, level = 27, point_type = 2051, owner = 353019, area_id = 29 },
	{ config_id = 353023, gadget_id = 70500000, pos = { x = -264.909, y = 243.051, z = 3375.735 }, rot = { x = 35.416, y = 239.662, z = 0.000 }, level = 27, point_type = 2051, owner = 353019, area_id = 29 },
	{ config_id = 353024, gadget_id = 70540041, pos = { x = -234.182, y = 236.634, z = 3522.581 }, rot = { x = 0.568, y = 1.947, z = 359.702 }, level = 27, area_id = 29 },
	{ config_id = 353025, gadget_id = 70500000, pos = { x = -234.433, y = 236.936, z = 3522.815 }, rot = { x = 331.911, y = 10.096, z = 340.738 }, level = 27, point_type = 2051, owner = 353024, area_id = 29 },
	{ config_id = 353026, gadget_id = 70500000, pos = { x = -233.838, y = 237.221, z = 3522.690 }, rot = { x = 4.059, y = 309.538, z = 39.679 }, level = 27, point_type = 2051, owner = 353024, area_id = 29 },
	{ config_id = 353027, gadget_id = 70500000, pos = { x = -234.055, y = 237.153, z = 3522.484 }, rot = { x = 14.587, y = 334.818, z = 359.459 }, level = 27, point_type = 2051, owner = 353024, area_id = 29 },
	{ config_id = 353028, gadget_id = 70500000, pos = { x = -233.849, y = 236.986, z = 3522.317 }, rot = { x = 35.479, y = 305.116, z = 359.217 }, level = 27, point_type = 2051, owner = 353024, area_id = 29 },
	{ config_id = 353029, gadget_id = 70500000, pos = { x = -66.617, y = 244.871, z = 3455.228 }, rot = { x = 0.000, y = 29.157, z = 9.358 }, level = 27, point_type = 2001, area_id = 29 },
	{ config_id = 353030, gadget_id = 70500000, pos = { x = -65.769, y = 245.832, z = 3411.098 }, rot = { x = 0.000, y = 342.044, z = 0.000 }, level = 27, point_type = 2004, area_id = 29 },
	{ config_id = 353031, gadget_id = 70500000, pos = { x = -157.173, y = 258.158, z = 3369.010 }, rot = { x = 0.000, y = 103.588, z = 0.000 }, level = 27, point_type = 2052, area_id = 29 },
	{ config_id = 353034, gadget_id = 70540041, pos = { x = -191.967, y = 258.888, z = 3456.249 }, rot = { x = 0.000, y = 56.860, z = 0.000 }, level = 27, area_id = 29 },
	{ config_id = 353035, gadget_id = 70500000, pos = { x = -192.222, y = 259.191, z = 3456.478 }, rot = { x = 331.307, y = 64.892, z = 340.983 }, level = 27, point_type = 2051, owner = 353034, area_id = 29 },
	{ config_id = 353036, gadget_id = 70500000, pos = { x = -191.628, y = 259.478, z = 3456.355 }, rot = { x = 3.949, y = 4.494, z = 40.312 }, level = 27, point_type = 2051, owner = 353034, area_id = 29 },
	{ config_id = 353037, gadget_id = 70500000, pos = { x = -191.842, y = 259.407, z = 3456.149 }, rot = { x = 14.217, y = 29.865, z = 0.000 }, level = 27, point_type = 2051, owner = 353034, area_id = 29 },
	{ config_id = 353038, gadget_id = 70500000, pos = { x = -191.633, y = 259.239, z = 3455.985 }, rot = { x = 35.416, y = 0.482, z = 0.000 }, level = 27, point_type = 2051, owner = 353034, area_id = 29 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 353001, 353002, 353003, 353004, 353005, 353006, 353007, 353008, 353009, 353010, 353011, 353012, 353013, 353014, 353015, 353016, 353017, 353018, 353019, 353020, 353021, 353022, 353023, 353024, 353025, 353026, 353027, 353028, 353029, 353030, 353031, 353034, 353035, 353036, 353037, 353038 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================