-- 基础信息
local base_info = {
	group_id = 133302366
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 366001, monster_id = 28030313, pos = { x = -81.214, y = 256.566, z = 2915.666 }, rot = { x = 0.000, y = 279.067, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 20 },
	{ config_id = 366002, monster_id = 28030313, pos = { x = -125.301, y = 254.048, z = 2734.247 }, rot = { x = 0.000, y = 125.776, z = 0.000 }, level = 27, drop_tag = "鸟类", pose_id = 3, area_id = 20 },
	{ config_id = 366003, monster_id = 28030303, pos = { x = -109.383, y = 253.643, z = 2712.160 }, rot = { x = 0.000, y = 58.838, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 20 },
	{ config_id = 366004, monster_id = 28030303, pos = { x = -106.030, y = 253.536, z = 2711.812 }, rot = { x = 0.000, y = 297.089, z = 0.000 }, level = 27, drop_tag = "鸟类", area_id = 20 },
	{ config_id = 366005, monster_id = 28020102, pos = { x = -126.200, y = 241.239, z = 2739.495 }, rot = { x = 0.000, y = 187.547, z = 0.000 }, level = 27, drop_tag = "走兽", area_id = 20 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 366006, gadget_id = 70500000, pos = { x = -120.895, y = 240.841, z = 2735.133 }, rot = { x = 0.000, y = 257.849, z = 0.000 }, level = 27, point_type = 2045, area_id = 20 },
	{ config_id = 366007, gadget_id = 70500000, pos = { x = -185.616, y = 201.551, z = 2720.884 }, rot = { x = 0.000, y = 219.444, z = 0.000 }, level = 27, point_type = 2045, area_id = 20 },
	{ config_id = 366008, gadget_id = 70500000, pos = { x = -179.151, y = 205.753, z = 2840.228 }, rot = { x = 359.810, y = 277.965, z = 1.359 }, level = 27, point_type = 2045, area_id = 20 },
	{ config_id = 366009, gadget_id = 70500000, pos = { x = -170.888, y = 201.669, z = 2884.511 }, rot = { x = 4.350, y = 0.503, z = 13.191 }, level = 27, point_type = 2045, area_id = 20 },
	{ config_id = 366010, gadget_id = 70500000, pos = { x = -175.314, y = 204.379, z = 2871.035 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2002, area_id = 20 },
	{ config_id = 366011, gadget_id = 70500000, pos = { x = -165.831, y = 204.468, z = 2862.961 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2002, area_id = 20 },
	{ config_id = 366012, gadget_id = 70500000, pos = { x = -157.083, y = 205.586, z = 2845.459 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2002, area_id = 20 },
	{ config_id = 366013, gadget_id = 70540037, pos = { x = -107.895, y = 271.189, z = 2845.418 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 366014, gadget_id = 70500000, pos = { x = -107.509, y = 271.564, z = 2845.240 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2049, owner = 366013, area_id = 20 },
	{ config_id = 366015, gadget_id = 70500000, pos = { x = -108.064, y = 271.910, z = 2845.732 }, rot = { x = 0.000, y = 270.022, z = 0.000 }, level = 27, point_type = 2049, owner = 366013, area_id = 20 },
	{ config_id = 366016, gadget_id = 70540037, pos = { x = -44.458, y = 265.563, z = 2885.463 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, area_id = 20 },
	{ config_id = 366017, gadget_id = 70500000, pos = { x = -44.072, y = 265.939, z = 2885.284 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 27, point_type = 2049, owner = 366016, area_id = 20 },
	{ config_id = 366018, gadget_id = 70500000, pos = { x = -44.627, y = 266.285, z = 2885.776 }, rot = { x = 0.000, y = 270.022, z = 0.000 }, level = 27, point_type = 2049, owner = 366016, area_id = 20 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 366001, 366002, 366003, 366004, 366005 },
		gadgets = { 366006, 366007, 366008, 366009, 366010, 366011, 366012, 366013, 366014, 366015, 366016, 366017, 366018 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================