-- 基础信息
local base_info = {
	group_id = 133106010
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 10001, gadget_id = 70290003, pos = { x = -810.049, y = 194.095, z = 1292.841 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 10002, gadget_id = 70500000, pos = { x = -810.049, y = 194.198, z = 1292.750 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 3003, owner = 10001, area_id = 8 },
	{ config_id = 10003, gadget_id = 70500000, pos = { x = -810.049, y = 194.198, z = 1292.943 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 3003, owner = 10001, area_id = 8 },
	{ config_id = 10004, gadget_id = 70500000, pos = { x = -926.755, y = 155.341, z = 1374.210 }, rot = { x = 0.000, y = 88.945, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 10005, gadget_id = 70500000, pos = { x = -975.024, y = 241.347, z = 1418.810 }, rot = { x = 0.000, y = 269.555, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 10006, gadget_id = 70500000, pos = { x = -899.780, y = 156.497, z = 1396.562 }, rot = { x = 0.000, y = 249.442, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 10007, gadget_id = 70500000, pos = { x = -860.369, y = 191.901, z = 1280.278 }, rot = { x = 0.000, y = 303.712, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 10008, gadget_id = 70500000, pos = { x = -987.606, y = 251.865, z = 1456.855 }, rot = { x = 0.000, y = 111.196, z = 0.000 }, level = 32, point_type = 2004 },
	{ config_id = 10009, gadget_id = 70500000, pos = { x = -1016.937, y = 262.054, z = 1420.545 }, rot = { x = 0.000, y = 208.485, z = 0.000 }, level = 32, point_type = 2004 },
	{ config_id = 10010, gadget_id = 70500000, pos = { x = -774.373, y = 214.308, z = 1353.451 }, rot = { x = 0.000, y = 167.637, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 10011, gadget_id = 70500000, pos = { x = -798.784, y = 239.043, z = 1377.955 }, rot = { x = 0.000, y = 262.929, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 10012, gadget_id = 70500000, pos = { x = -974.263, y = 244.430, z = 1433.262 }, rot = { x = 0.000, y = 190.802, z = 0.000 }, level = 32, point_type = 2004 },
	{ config_id = 10013, gadget_id = 70500000, pos = { x = -840.648, y = 156.342, z = 1337.282 }, rot = { x = 0.000, y = 194.668, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 10014, gadget_id = 70500000, pos = { x = -899.921, y = 203.166, z = 1468.119 }, rot = { x = 0.000, y = 27.054, z = 0.000 }, level = 32, point_type = 2004 },
	{ config_id = 10015, gadget_id = 70500000, pos = { x = -838.292, y = 236.024, z = 1445.273 }, rot = { x = 0.000, y = 152.638, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 10016, gadget_id = 70500000, pos = { x = -894.224, y = 156.614, z = 1318.224 }, rot = { x = 0.000, y = 351.828, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 10017, gadget_id = 70500000, pos = { x = -974.511, y = 235.980, z = 1327.132 }, rot = { x = 0.000, y = 169.151, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 10018, gadget_id = 70500000, pos = { x = -826.066, y = 194.043, z = 1389.816 }, rot = { x = 0.000, y = 326.496, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 10019, gadget_id = 70290001, pos = { x = -828.559, y = 155.839, z = 1290.683 }, rot = { x = 0.000, y = 16.790, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 10020, gadget_id = 70500000, pos = { x = -828.427, y = 156.408, z = 1291.062 }, rot = { x = 0.000, y = 16.780, z = 0.000 }, level = 32, point_type = 3002, owner = 10019, area_id = 8 },
	{ config_id = 10021, gadget_id = 70500000, pos = { x = -828.736, y = 156.694, z = 1290.322 }, rot = { x = 0.000, y = 16.780, z = 0.000 }, level = 32, point_type = 3002, owner = 10019, area_id = 8 },
	{ config_id = 10022, gadget_id = 70500000, pos = { x = -828.332, y = 157.106, z = 1290.507 }, rot = { x = 0.000, y = 16.780, z = 0.000 }, level = 32, point_type = 3002, owner = 10019, area_id = 8 },
	{ config_id = 10023, gadget_id = 70290001, pos = { x = -923.568, y = 155.409, z = 1345.120 }, rot = { x = 0.000, y = 328.620, z = 0.000 }, level = 32, area_id = 8 },
	{ config_id = 10024, gadget_id = 70500000, pos = { x = -923.762, y = 155.978, z = 1345.471 }, rot = { x = 0.000, y = 328.650, z = 0.000 }, level = 32, point_type = 3002, owner = 10023, area_id = 8 },
	{ config_id = 10025, gadget_id = 70500000, pos = { x = -923.417, y = 156.264, z = 1344.748 }, rot = { x = 0.000, y = 328.650, z = 0.000 }, level = 32, point_type = 3002, owner = 10023, area_id = 8 },
	{ config_id = 10026, gadget_id = 70500000, pos = { x = -923.285, y = 156.676, z = 1345.171 }, rot = { x = 0.000, y = 328.650, z = 0.000 }, level = 32, point_type = 3002, owner = 10023, area_id = 8 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 10001, 10002, 10003, 10004, 10005, 10006, 10007, 10008, 10009, 10010, 10011, 10012, 10013, 10014, 10015, 10016, 10017, 10018, 10019, 10020, 10021, 10022, 10023, 10024, 10025, 10026 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================