-- 基础信息
local base_info = {
	group_id = 133106020
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 20001, gadget_id = 70500000, pos = { x = -169.651, y = 256.176, z = 1284.847 }, rot = { x = 0.000, y = 0.693, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 20002, gadget_id = 70500000, pos = { x = -247.343, y = 282.799, z = 1343.982 }, rot = { x = 0.000, y = 193.848, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 20003, gadget_id = 70500000, pos = { x = -151.183, y = 281.453, z = 1384.153 }, rot = { x = 0.000, y = 91.282, z = 0.000 }, level = 32, point_type = 2001, area_id = 6 },
	{ config_id = 20004, gadget_id = 70500000, pos = { x = -226.705, y = 280.478, z = 1336.057 }, rot = { x = 0.000, y = 163.200, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 20005, gadget_id = 70500000, pos = { x = -103.913, y = 265.135, z = 1374.800 }, rot = { x = 0.000, y = 85.647, z = 0.000 }, level = 24, point_type = 2004, area_id = 6 },
	{ config_id = 20006, gadget_id = 70500000, pos = { x = -35.564, y = 264.593, z = 1370.107 }, rot = { x = 0.000, y = 295.261, z = 0.000 }, level = 24, point_type = 2001, area_id = 6 },
	{ config_id = 20007, gadget_id = 70500000, pos = { x = -148.712, y = 315.611, z = 1513.249 }, rot = { x = 0.000, y = 333.538, z = 0.000 }, level = 24, point_type = 2004 },
	{ config_id = 20008, gadget_id = 70500000, pos = { x = -77.754, y = 230.056, z = 1292.641 }, rot = { x = 0.000, y = 136.141, z = 0.000 }, level = 24, point_type = 2001, area_id = 6 },
	{ config_id = 20009, gadget_id = 70500000, pos = { x = -41.130, y = 282.441, z = 1431.272 }, rot = { x = 0.000, y = 267.766, z = 0.000 }, level = 24, point_type = 2001, area_id = 6 },
	{ config_id = 20010, gadget_id = 70500000, pos = { x = -144.550, y = 265.954, z = 1310.329 }, rot = { x = 0.000, y = 69.126, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 20011, gadget_id = 70500000, pos = { x = -255.429, y = 286.146, z = 1289.790 }, rot = { x = 0.000, y = 32.664, z = 0.000 }, level = 32, point_type = 2004, area_id = 8 },
	{ config_id = 20012, gadget_id = 70500000, pos = { x = -241.560, y = 295.474, z = 1416.170 }, rot = { x = 0.000, y = 150.065, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 20013, gadget_id = 70500000, pos = { x = -211.621, y = 281.918, z = 1385.329 }, rot = { x = 0.000, y = 16.379, z = 0.000 }, level = 32, point_type = 2001, area_id = 8 },
	{ config_id = 20014, gadget_id = 70500000, pos = { x = -59.611, y = 288.719, z = 1490.417 }, rot = { x = 0.000, y = 304.014, z = 0.000 }, level = 24, point_type = 2001, area_id = 6 },
	{ config_id = 20015, gadget_id = 70500000, pos = { x = -120.455, y = 281.480, z = 1459.868 }, rot = { x = 0.000, y = 190.312, z = 0.000 }, level = 24, point_type = 2004 },
	{ config_id = 20016, gadget_id = 70500000, pos = { x = -215.904, y = 284.277, z = 1450.653 }, rot = { x = 0.000, y = 351.717, z = 0.000 }, level = 32, point_type = 2001 },
	{ config_id = 20017, gadget_id = 70500000, pos = { x = -255.022, y = 311.311, z = 1493.795 }, rot = { x = 0.000, y = 195.944, z = 0.000 }, level = 32, point_type = 2004 },
	{ config_id = 20018, gadget_id = 70500000, pos = { x = -4.573, y = 204.609, z = 1299.891 }, rot = { x = 0.000, y = 348.633, z = 0.000 }, level = 24, point_type = 2004, area_id = 6 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 20001, 20002, 20003, 20004, 20005, 20006, 20007, 20008, 20009, 20010, 20011, 20012, 20013, 20014, 20015, 20016, 20017, 20018 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================