--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 299002, monster_id = 22010101, pos = { x = -6458.361, y = 200.199, z = -2756.558 }, rot = { x = 0.000, y = 199.282, z = 0.000 }, level = 1, drop_tag = "深渊法师", disableWander = true, pose_id = 9013, climate_area_id = 7, area_id = 18 },
	{ config_id = 299003, monster_id = 22050201, pos = { x = -6463.242, y = 200.085, z = -2763.408 }, rot = { x = 0.000, y = 48.323, z = 0.000 }, level = 1, drop_tag = "兽境猎犬", disableWander = true, pose_id = 101, climate_area_id = 7, area_id = 18 },
	{ config_id = 299004, monster_id = 22040201, pos = { x = -6458.377, y = 200.055, z = -2763.406 }, rot = { x = 0.000, y = 346.566, z = 0.000 }, level = 1, drop_tag = "兽境幼兽", disableWander = true, pose_id = 101, climate_area_id = 7, area_id = 18 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 299001, gadget_id = 70300107, pos = { x = -6459.398, y = 200.064, z = -2759.658 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, state = GadgetState.GearStart, area_id = 18 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 299002, 299003, 299004 },
		gadgets = { 299001 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================