-- 基础信息
local base_info = {
	group_id = 201066001
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 1001, gadget_id = 70710453, pos = { x = -2.655, y = 1.006, z = 1.566 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, room = 1 },
	{ config_id = 1002, gadget_id = 70710456, pos = { x = -2.805, y = 1.006, z = 1.134 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, room = 1 },
	{ config_id = 1003, gadget_id = 70710452, pos = { x = -2.435, y = 1.006, z = 0.952 }, rot = { x = 0.000, y = 289.340, z = 0.000 }, level = 1, room = 1 },
	{ config_id = 1004, gadget_id = 70710460, pos = { x = -2.742, y = 1.006, z = 0.411 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, room = 1 },
	{ config_id = 1005, gadget_id = 70710454, pos = { x = -2.337, y = 1.006, z = 1.362 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, room = 1 },
	{ config_id = 1006, gadget_id = 70710453, pos = { x = -2.484, y = 1.006, z = 0.244 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, room = 1 },
	{ config_id = 1007, gadget_id = 70710456, pos = { x = -2.650, y = 1.006, z = -0.171 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, room = 1 },
	{ config_id = 1008, gadget_id = 70710458, pos = { x = -2.680, y = 1.006, z = 1.416 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, room = 1 },
	{ config_id = 1009, gadget_id = 70710454, pos = { x = -2.337, y = 1.006, z = 1.151 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, room = 1 },
	{ config_id = 1010, gadget_id = 70710458, pos = { x = -2.743, y = 1.006, z = 0.474 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, room = 1 },
	{ config_id = 1011, gadget_id = 70710454, pos = { x = -2.400, y = 1.006, z = 0.209 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 1, room = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 1006, 1007, 1008, 1009 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = ,
		monsters = { },
		gadgets = { 1001, 1002, 1003, 1004, 1005 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 3,
		-- description = ,
		monsters = { },
		gadgets = { 1010, 1011 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================